jonacappelle/nRF52-DCU/UTIL/usr_internal_comm.c
#include "usr_internal_comm.h"

#include "usr_uart.h"
#include "usr_ble.h"
#include "usr_time_sync.h"

#include "internal_comm_protocol.h"


// Logging
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"
#define NRF_LOG_MODULE_NAME usr_internal_comm_c
#include "nrf_log.h"
NRF_LOG_MODULE_REGISTER();


stm32_time_t global_time = 0;
uint32_t offset_time = 0;


static void decode_meas(uint8_t data)
{
    switch (data)
    {
    case COMM_CMD_MEAS_RAW:
        NRF_LOG_INFO("COMM_CMD_MEAS_RAW");
        set_config_raw_enable(1);
        comm_send_ok(COMM_CMD_MEAS);
        break;

    case COMM_CMD_MEAS_QUAT6:
        NRF_LOG_INFO("COMM_CMD_MEAS_QUAT6");
        set_config_quat6_enable(1);
        comm_send_ok(COMM_CMD_MEAS);
        break;

    case COMM_CMD_MEAS_QUAT9:
        NRF_LOG_INFO("COMM_CMD_MEAS_QUAT9");
        set_config_quat9_enable(1);
        comm_send_ok(COMM_CMD_MEAS);
        break;

    case COMM_CMD_MEAS_WOM:
        NRF_LOG_INFO("COMM_CMD_MEAS_WOM");
        set_config_wom_enable(1);
        comm_send_ok(COMM_CMD_MEAS);
        break;

    default:
        break;
    }
}

static void decode_sync(uint8_t data)
{
    ret_code_t err_code;

    switch (data)
    {
    case COMM_CMD_START_SYNC:
        NRF_LOG_INFO("COMM_CMD_START_SYNC");
        sync_enable();
        // comm_send_ok();
        break;
    
    case COMM_CMD_STOP_SYNC:
        NRF_LOG_INFO("COMM_CMD_STOP_SYNC");
        sync_disable();
        // comm_send_ok();
        break;

    default:
        sync_disable();
        break;
    }
}

static void decode_frequency(uint8_t data)
{
    set_config_frequency(data);
}

void send_battery_voltages()
{
    // | START_BYTE | packet_len | command (DATA_BYTE) |  sensor_nr |  data_type | data | CS |
    // | ----------- |-----------|-----------|------------|-----------|----------------|---|
    // | 1 byte     | 1 byte     | 1 byte               | 1 byte    | 1 byte    | k bytes | 1 byte |

    ret_code_t err_code;

    BATTERY_ARRAY bat;
    uint32_t len;
    get_battery(&bat, &len);

    uint8_t data_out[USR_INTERNAL_COMM_MAX_LEN]; //64 bytes long is more than enough for a data packet
    uint32_t data_len;
    data_type_byte_t type_byte;
    command_byte_t command_byte;

    // Fill configuration bytes
    data_out[0] = START_BYTE;

    data_len = 0;
    // Length of frame
    data_len += OVERHEAD_BYTES-1;

    // Tell the receiver its data we're sending
    command_byte = CONFIG;

    // TODO match this to the MAC address - keep track of list of MAC addresses
    // uint8_t sensor_nr = 0;

    data_out[2] = command_byte;
    // data_out[3] = sensor_nr;
    data_out[3] = COMM_CMD_REQ_BATTERY_LEVEL;

    // Copy data to packet
    memcpy((data_out + PACKET_DATA_PLACEHOLDER-1), &bat, len);

    // Set data len
    data_len += len;
    data_out[1] = (uint8_t) data_len;

    // Checksum
    uint8_t cs = calculate_cs(data_out, &data_len);
    data_out[PACKET_DATA_PLACEHOLDER-1 + len] = cs;

    // check for buffer overflows
    check_buffer_overflow(&data_len);

    // Send over UART to STM32
    uart_queued_tx(data_out, &data_len);
    // NRF_LOG_INFO("Data send");  
}



void uart_send_conn_dev(dcu_connected_devices_t* dev, uint32_t len)
{
    // | START_BYTE | packet_len | command (DATA_BYTE)  |  data_type | data    |   CS    |
    // | ----------- |-----------|----------------------|------------|---------|---------|
    // | 1 byte     | 1 byte     | 1 byte               |   1 byte    | k bytes | 1 byte |

    ret_code_t err_code;

    uint8_t data_out[USR_INTERNAL_COMM_MAX_LEN]; //64 bytes long is more than enough for a data packet
    uint32_t data_len;
    data_type_byte_t type_byte;
    command_byte_t command_byte;

    // Fill configuration bytes
    data_out[0] = START_BYTE;

    data_len = 0;
    // Length of frame
    data_len += OVERHEAD_BYTES-1;

    // Tell the receiver its data we're sending
    command_byte = CONFIG;

    // TODO match this to the MAC address - keep track of list of MAC addresses
    // uint8_t sensor_nr = 0;

    data_out[2] = command_byte;
    // data_out[3] = sensor_nr;
    data_out[3] = COMM_CMD_REQ_CONN_DEV_LIST;

    // Copy data to packet
    memcpy((data_out + PACKET_DATA_PLACEHOLDER-1), dev, len);

    // Set data len
    data_len += len;
    data_out[1] = (uint8_t) data_len;

    // Checksum
    uint8_t cs = calculate_cs(data_out, &data_len);
    data_out[PACKET_DATA_PLACEHOLDER-1 + len] = cs;

    // check for buffer overflows
    check_buffer_overflow(&data_len);

    // Send over UART to STM32
    uart_queued_tx(data_out, &data_len);
    // NRF_LOG_INFO("Data send");   
}

void uart_send_conn_dev_update(ble_gap_addr_t* dev, uint32_t len, command_type_conn_dev_update_byte_t state)
{
    // | START_BYTE | packet_len | command (DATA_BYTE)  |  data_type | data    |   CS    |
    // | ----------- |-----------|----------------------|------------|---------|---------|
    // | 1 byte     | 1 byte     | 1 byte               |   1 byte    | k bytes | 1 byte |

    ret_code_t err_code;

    uint8_t data_out[USR_INTERNAL_COMM_MAX_LEN]; //64 bytes long is more than enough for a data packet
    uint32_t data_len;
    data_type_byte_t type_byte;
    command_byte_t command_byte;

    // Fill configuration bytes
    data_out[0] = START_BYTE;

    data_len = 0;
    // Length of frame
    data_len += OVERHEAD_BYTES-1;

    // Tell the receiver its data we're sending
    command_byte = CONFIG;

    // TODO match this to the MAC address - keep track of list of MAC addresses
    // uint8_t sensor_nr = 0;

    data_out[2] = command_byte;
    // data_out[3] = sensor_nr;
    data_out[3] = COMM_CMD_CONN_DEV_UPDATE;

    // Copy data to packet
    memcpy((data_out + PACKET_DATA_PLACEHOLDER-1), &state, sizeof(state));
    memcpy((data_out + PACKET_DATA_PLACEHOLDER-1 + sizeof(state)), dev, len);

    // Set data len
    data_len += len;
    data_len += sizeof(state);
    data_out[1] = (uint8_t) data_len;

    // Checksum
    uint8_t cs = calculate_cs(data_out, &data_len);
    data_out[PACKET_DATA_PLACEHOLDER-1 + len + sizeof(command_type_conn_dev_update_byte_t)] = cs;

    // check for buffer overflows
    check_buffer_overflow(&data_len);

    // Send over UART to STM32
    uart_queued_tx(data_out, &data_len);
    // NRF_LOG_INFO("Data send");   
}

void comm_rx_process(void *p_event_data, uint16_t event_size)
{
    //| START_BYTE | packet_len | command (CONFIG_BYTE) |  config_data | CS    |
    //| ----------- |-----------|---------           --|------------- |-----  -|
    //| 1 byte        | 1 byte  |               1 byte |      k bytes |  1 byte |


    // Get data from buffer - store in var rx_data
    uint8_t p_byte;
    uint8_t rx_data[USR_INTERNAL_COMM_MAX_LEN];
    uint8_t i = 0;
    while ((uart_rx_buff_get(&p_byte) != NRF_ERROR_NOT_FOUND))
    {
        rx_data[i] = p_byte;
        i++;
    }

    // Store the received packet length
    uint32_t len = i;

    // Check if start byte is correct
    if(rx_data[0] != START_BYTE)
    {
        NRF_LOG_INFO("Invalid RX packet received");
        NRF_LOG_INFO("Start byte not correct");
        return;
    }

    // Check if packet len == received packet len
    if(rx_data[1] != len)
    {
        NRF_LOG_INFO("Invalid RX packet received");
        NRF_LOG_INFO("Invalid RX packet len");
        return;
    }
    
