jonacappelle/nRF52-DCU/UTIL/usr_internal_comm.c
    // Check checksum (not including last CS byte)
    uint32_t len_no_cs = len - CS_LEN;
    uint8_t cs = calculate_cs(rx_data, &len);

    if(cs != rx_data[len_no_cs])
    {
        NRF_LOG_INFO("Correct CS: 0x%X - Received CS: 0x%X", cs, rx_data[len_no_cs]);
        NRF_LOG_INFO("len: %d - 0x%X", len, len);

        NRF_LOG_INFO("Invalid RX packet received");
        NRF_LOG_INFO("Invalid RX packet CS");
        return;
    }

    // Check for command dataframe
    command_byte_t command = rx_data[2];
    if(command !=  CONFIG)
    {
        NRF_LOG_INFO("Invalid RX packet received");
        NRF_LOG_INFO("Invalid COMMAND received");
        return;
    }

    NRF_LOG_INFO("Correct payload packet received");
    NRF_LOG_FLUSH();

    // Decode payload
    uint8_t remaining_data_len = len_no_cs - CONFIG_PACKET_DATA_OFFSET;
    uint8_t j = CONFIG_PACKET_DATA_OFFSET;
    
    while(remaining_data_len >=1) // Keep processing when there is data available
    {
        NRF_LOG_INFO("remaining_data_len: %d", remaining_data_len);

        uint8_t config_data = rx_data[j]; // Get packet
        NRF_LOG_INFO("Config data: 0x%X", config_data);
        NRF_LOG_FLUSH();

        switch (config_data)
        {
        case COMM_CMD_SET_CONN_DEV_LIST: // WORKING
        {

            NRF_LOG_INFO("COMM_CMD_SET_CONN_DEV_LIST");
            
            dcu_conn_dev_t conn_dev[NRF_BLE_SCAN_ADDRESS_CNT];
             // Init with zeros
            memset(conn_dev, 0, sizeof(conn_dev));

            // Copy data into buffer
            memcpy(conn_dev, &rx_data[j+1], sizeof(conn_dev));

            // Return packet with connected devices
            set_conn_dev_mask(conn_dev, sizeof(conn_dev));

            remaining_data_len = remaining_data_len - sizeof(conn_dev) - 1;
            // j++;

            comm_send_ok(COMM_CMD_SET_CONN_DEV_LIST);

        }break;

        case COMM_CMD_REQ_CONN_DEV_LIST: // WORKING
        {
            NRF_LOG_INFO("COMM_CMD_REQ_CONN_DEV_LIST");

            dcu_connected_devices_t dev[NRF_SDH_BLE_CENTRAL_LINK_COUNT];
            get_connected_devices(dev, sizeof(dev));
            
            uart_send_conn_dev(dev, sizeof(dev));

            remaining_data_len--;
            j++;

        } break;

        case COMM_CMD_START: // WORKING

            NRF_LOG_INFO("COMM_CMD_START with time");

            // Handle epoch time from STM32
            uint8_t *temp_time1 = &rx_data[j+1];
            stm32_time_t epoch_time1;
            NRF_LOG_INFO("epoch time: %d %X", epoch_time1, epoch_time1);
            memcpy(&epoch_time1, temp_time1, sizeof(epoch_time1));

            // Send the configuration to all sensors
            uint32_t offset = config_send();

            set_stm32_real_time(epoch_time1, offset);

            // remaining_data_len--;
            // j++;
            remaining_data_len--;
            remaining_data_len -= 8;
            j++;
            j += 8;
            break;

        case COMM_CMD_STOP:

            NRF_LOG_INFO("COMM_CMD_STOP");

            config_send_stop();
            // set_config_reset();
            // config_send();
            remaining_data_len--;
            j++;
            break;

        case COMM_CMD_MEAS: // WORKING

            NRF_LOG_INFO("COMM_CMD_MEAS");

            // Check which measurement to start
            config_data = rx_data[j+1]; // Peek the next byte

            // Decode meas payload
            decode_meas(config_data);

            remaining_data_len = remaining_data_len-2;
            j=j+2;
            break;
        
        case COMM_CMD_SYNC: // WORKING

            NRF_LOG_INFO("COMM_CMD_SYNC");
            
            config_data = rx_data[j+1];
            
            decode_sync(config_data);

            remaining_data_len = remaining_data_len-2;
            j=j+2;
            break;

        case COMM_CMD_FREQUENCY: // WORKING

            NRF_LOG_INFO("COMM_CMD_FREQUENCY");

            config_data = rx_data[j+1];

            decode_frequency(config_data);
            comm_send_ok(COMM_CMD_FREQUENCY);

            remaining_data_len = remaining_data_len-2;
            j=j+2;
            break;

        case COMM_CMD_CALIBRATE:

            NRF_LOG_INFO("COMM_CMD_CALIBRATE");

            set_config_start_calibration(1);
            config_send();
            set_config_start_calibration(0);

            remaining_data_len--;
            j++;

            break;

        case COMM_CMD_RESET:

            NRF_LOG_INFO("COMM_CMD_RESET");

            set_config_reset();
            comm_send_ok(COMM_CMD_RESET);

            remaining_data_len--;
            j++;
            break;

        case COMM_CMD_REQ_BATTERY_LEVEL: // WORKING

            NRF_LOG_INFO("COMM_CMD_REQ_BATTERY_LEVEL");

            // TODO return battery level packet
            send_battery_voltages();

            remaining_data_len--;
            j++;
            break;

        case COMM_CMD_TIME:;
            
            NRF_LOG_INFO("COMM_CMD_TIME");

            NRF_LOG_INFO("%X", rx_data[j+1]);
            NRF_LOG_INFO("%X", rx_data[j+2]);
            NRF_LOG_INFO("%X", rx_data[j+3]);
            NRF_LOG_INFO("%X", rx_data[j+4]);
            NRF_LOG_INFO("%X", rx_data[j+5]);
            NRF_LOG_INFO("%X", rx_data[j+6]);
            NRF_LOG_INFO("%X", rx_data[j+7]);
            NRF_LOG_INFO("%X", rx_data[j+8]);

            uint8_t *temp_time = &rx_data[j+1];
            stm32_time_t epoch_time;
            NRF_LOG_INFO("epoch time: %d %X", epoch_time, epoch_time);
            memcpy(&epoch_time, temp_time, sizeof(epoch_time));

            // TODO: offset assumed 0 for now, this introduces an error of the time needed to transmit this value to the sensors and start the measurement
            set_stm32_real_time(epoch_time, 0);

            remaining_data_len--;
            remaining_data_len -= 8;
            j++;
            j += 8;
            break;

        default:
            break;
        }
    }

    check_not_negative_uint8(&remaining_data_len);
}


stm32_time_t get_stm32_real_time()
{
    return global_time;
}

void set_stm32_real_time(stm32_time_t time, uint32_t this_offset)
{
    global_time = time;
    offset_time = this_offset;

