jonacappelle/nRF52-DCU/UTIL/usr_internal_comm.c
    char string[20];
    sprintf(string, "%llu", global_time);

    NRF_LOG_INFO("Time updated, global time is now: ");
    NRF_LOG_INFO("time: %s", (uint32_t) string);
    NRF_LOG_INFO("Offset to start of measurement: %d", offset_time);
}

stm32_time_t calculate_total_time(stm32_time_t local_time)
{
    stm32_time_t total_time;
    stm32_time_t real_time = get_stm32_real_time();
    uint32_t offset = offset_time;

    // Calculate
    // -------- = Start time + Time since start of measurement + offset time to wait before measurement has actually started
    total_time = real_time + local_time + offset;

    return total_time;
}


static uint8_t calculate_cs(uint8_t * data, uint32_t * len) //tested
{
    // Init to zero
    uint8_t cs = 0x00;

    for (uint32_t i=0; i<(*len-1); i++)
    {
        // XOR
        cs ^= data[i];
    }

    return cs;
}

void comm_send_ok(command_type_byte_t command_type)
{
    // | START_BYTE | packet_len | command (DATA_BYTE) |  sensor_nr |  data_type | data | CS |
    // | ----------- |-----------|-----------|------------|-----------|----------------|---|
    // | 1 byte     | 1 byte     | 1 byte               | 1 byte    | 1 byte    | k bytes | 1 byte |

    NRF_LOG_INFO("SEND FEEDBACK over uart");

    ret_code_t err_code;

    uint8_t data_out[USR_INTERNAL_COMM_MAX_LEN]; //64 bytes long is more than enough for a data packet
    uint32_t data_len;
    data_type_byte_t type_byte;
    command_byte_t command_byte;

    // Fill configuration bytes
    data_out[0] = START_BYTE;

    data_len = 0;
    // Length of frame
    data_len += OVERHEAD_BYTES;

    // Tell the receiver its config we're sending
    command_byte = CONFIG;

    // TODO match this to the MAC address - keep track of list of MAC addresses
    // uint8_t sensor_nr = data_in->conn_handle + 1;
    uint8_t sensor_nr = 0xFF;

    data_out[2] = command_byte;
    data_out[3] = COMM_CMD_OK;
    data_out[4] = sensor_nr;

    data_len += sizeof(command_type); // No data to be added to OK packet
    data_out[1] = (uint8_t) data_len;

    // Copy data into packet
    memcpy((data_out + PACKET_DATA_PLACEHOLDER), &command_type, sizeof(command_type));

    // Checksum
    uint8_t cs = calculate_cs(data_out, &data_len);
    data_out[PACKET_DATA_PLACEHOLDER + sizeof(command_type)] = cs;

    // check for buffer overflows
    check_buffer_overflow(&data_len);

    // Send over UART to STM32
    uart_queued_tx(data_out, &data_len);
}


// Tested and working
void comm_process(ble_imu_service_c_evt_type_t type, ble_imu_service_c_evt_t * data_in)
{
    // | START_BYTE | packet_len | command (DATA_BYTE) |  sensor_nr |  data_type | data | CS |
    // | ----------- |-----------|-----------|------------|-----------|----------------|---|
    // | 1 byte     | 1 byte     | 1 byte               | 1 byte    | 1 byte    | k bytes | 1 byte |

    ret_code_t err_code;

    uint8_t data_out[USR_INTERNAL_COMM_MAX_LEN]; //64 bytes long is more than enough for a data packet
    uint32_t data_len;
    data_type_byte_t type_byte;
    command_byte_t command_byte;

    // Fill configuration bytes
    data_out[0] = START_BYTE;

    // Calibration info
    if(type == BLE_IMU_SERVICE_EVT_INFO) // If we have calibration info, send it!
    {
        NRF_LOG_INFO("SEND CALIBRATION CONFIG over uart");

        data_len = 0;
        // Length of frame
        data_len += OVERHEAD_BYTES;

        // Tell the receiver its config we're sending
        command_byte = CONFIG;

        // TODO match this to the MAC address - keep track of list of MAC addresses
        uint8_t sensor_nr = data_in->conn_handle;

        data_out[2] = command_byte;
        
        data_out[4] = sensor_nr;

        // NRF_LOG_HEXDUMP_INFO(data_out, data_len);

        uint8_t temp;

        if(data_in->params.value.info_data.sync_complete || data_in->params.value.info_data.sync_lost)
        {
            if(data_in->params.value.info_data.sync_complete) temp = COMM_CMD_SYNC_COMPLETE;
            else if(data_in->params.value.info_data.sync_lost) temp = COMM_CMD_SYNC_LOST;

            data_out[3] = COMM_CMD_SYNC;

        }else{
            if(data_in->params.value.info_data.calibration_start) temp = COMM_CMD_CALIBRATION_START;
            
            if(data_in->params.value.info_data.gyro_calibration_done) temp = COMM_CMD_CALIBRATION_GYRO_DONE;
            
            if (data_in->params.value.info_data.accel_calibration_drone && data_in->params.value.info_data.gyro_calibration_done) temp = COMM_CMD_CALIBRATION_ACCEL_DONE;
            
            if(data_in->params.value.info_data.accel_calibration_drone && data_in->params.value.info_data.gyro_calibration_done && data_in->params.value.info_data.mag_calibration_done) temp = COMM_CMD_CALIBRATION_MAG_DONE;

            if(data_in->params.value.info_data.calibration_done) temp = COMM_CMD_CALIBRATION_DONE;

            data_out[3] = COMM_CMD_CALIBRATE;
        }


        data_len += sizeof(uint8_t);
        data_out[1] = (uint8_t) data_len;

        // Copy data into packet
        memcpy((data_out + PACKET_DATA_PLACEHOLDER), &temp, sizeof(temp));

        // NRF_LOG_HEXDUMP_INFO(data_out, data_len);

        // Checksum
        uint8_t cs = calculate_cs(data_out, &data_len);
        data_out[PACKET_DATA_PLACEHOLDER + sizeof(temp)] = cs;

        // NRF_LOG_HEXDUMP_INFO(data_out, data_len);

        // Send over UART to STM32
        uart_queued_tx(data_out, &data_len);
        // NRF_LOG_INFO("Data send");

    }else{ // Else it's DATA

    // BLE_PACKET_BUFFER_COUNT bytes in 1 BLE packet
    for(uint8_t i=0; i<BLE_PACKET_BUFFER_COUNT; i++)
    {
        data_len = 0;
        // Length of frame
        data_len += OVERHEAD_BYTES;

        // Tell the receiver its data we're sending
        command_byte = DATA;

        uint8_t sensor_nr = data_in->conn_handle;

        data_out[2] = command_byte;
        data_out[3] = sensor_nr;

        switch (type)
        {
            case BLE_IMU_SERVICE_EVT_QUAT:
            {
                ble_imu_service_quat_t *quat = &data_in->params.value.quat_data;

                data_len += (4*sizeof(int32_t))/sizeof(uint8_t);
                data_len += sizeof(stm32_time_t)/sizeof(uint8_t);

