jonacappelle/nRF52-DCU/UTIL/usr_internal_comm.c
                data_out[1] = (uint8_t) data_len; //22

                type_byte = QUATERNIONS;
                data_out[4] = type_byte;

                // Copy data to packet
                memcpy((data_out + PACKET_DATA_PLACEHOLDER), &quat->quat[i].w, sizeof(int32_t));
                memcpy((data_out + PACKET_DATA_PLACEHOLDER + sizeof(int32_t)), &quat->quat[i].x, sizeof(int32_t));
                memcpy((data_out + PACKET_DATA_PLACEHOLDER + 2*sizeof(int32_t)), &quat->quat[i].y, sizeof(int32_t));
                memcpy((data_out + PACKET_DATA_PLACEHOLDER + 3*sizeof(int32_t)), &quat->quat[i].z, sizeof(int32_t));
                
                // Timestamp ms
                stm32_time_t time = calculate_total_time(quat->quat[i].timestamp_ms);
                memcpy((data_out + PACKET_DATA_PLACEHOLDER + 4*sizeof(int32_t)), &time, sizeof(stm32_time_t));

                // Checksum
                uint8_t cs = calculate_cs(data_out, &data_len);
                data_out[PACKET_DATA_PLACEHOLDER + 4*sizeof(int32_t) + sizeof(stm32_time_t)] = cs;


                NRF_LOG_INFO("Time diff: %d", quat->quat[i].timestamp_ms);

            }break;

            case BLE_IMU_SERVICE_EVT_EULER:
            {
                NRF_LOG_INFO("Not implemented yet");
                
                
            }break;
            case BLE_IMU_SERVICE_EVT_RAW:
            {
                ble_imu_service_raw_t *raw = &data_in->params.value.raw_data;

                data_len += (3*3*sizeof(int16_t))/sizeof(uint8_t);
                data_len += sizeof(stm32_time_t)/sizeof(uint8_t);

                type_byte = RAW;
                data_out[4] = type_byte;
                data_out[1] = (uint8_t) data_len; //24 bytes

                // Copy data to packet
                memcpy((data_out + PACKET_DATA_PLACEHOLDER), &raw->single_raw[i].accel.x, sizeof(int16_t));
                memcpy((data_out + PACKET_DATA_PLACEHOLDER + sizeof(int16_t)), &raw->single_raw[i].accel.y, sizeof(int16_t));
                memcpy((data_out + PACKET_DATA_PLACEHOLDER + 2*sizeof(int16_t)), &raw->single_raw[i].accel.z, sizeof(int16_t));

                memcpy((data_out + PACKET_DATA_PLACEHOLDER + 3*sizeof(int16_t)), &raw->single_raw[i].gyro.x, sizeof(int16_t));
                memcpy((data_out + PACKET_DATA_PLACEHOLDER + 4*sizeof(int16_t)), &raw->single_raw[i].gyro.y, sizeof(int16_t));
                memcpy((data_out + PACKET_DATA_PLACEHOLDER + 5*sizeof(int16_t)), &raw->single_raw[i].gyro.z, sizeof(int16_t));

                memcpy((data_out + PACKET_DATA_PLACEHOLDER + 6*sizeof(int16_t)), &raw->single_raw[i].compass.x, sizeof(int16_t));
                memcpy((data_out + PACKET_DATA_PLACEHOLDER + 7*sizeof(int16_t)), &raw->single_raw[i].compass.y, sizeof(int16_t));
                memcpy((data_out + PACKET_DATA_PLACEHOLDER + 8*sizeof(int16_t)), &raw->single_raw[i].compass.z, sizeof(int16_t));

                // Timestamp ms
                stm32_time_t time = calculate_total_time(raw->single_raw[i].timestamp_ms);
                memcpy((data_out + PACKET_DATA_PLACEHOLDER + 9*sizeof(int16_t)), &time, sizeof(stm32_time_t));
                NRF_LOG_INFO("time diff: %d", raw->single_raw[i].timestamp_ms);

                // Checksum
                uint8_t cs = calculate_cs(data_out, &data_len);
                data_out[PACKET_DATA_PLACEHOLDER + 3*3*sizeof(int16_t) + sizeof(stm32_time_t)] = cs;

            }break;

            default:
            {

                NRF_LOG_INFO("default");
                NRF_LOG_FLUSH();

            }break;
        }

        // check for buffer overflows
        check_buffer_overflow(&data_len);

        // Send over UART to STM32
        uart_queued_tx(data_out, &data_len);
        // NRF_LOG_INFO("Data send");

    }

    }
}



// Error checking helper functions

static void check_buffer_overflow(uint32_t* len)
{
    ret_code_t err_code;

    if(*len >= USR_INTERNAL_COMM_MAX_LEN)
    {
        NRF_LOG_INFO("data_len: %d", *len);
        err_code = NRF_ERROR_NO_MEM;
        APP_ERROR_CHECK(err_code);
    }

}


static void check_not_negative_uint8(uint8_t* data)
{
    ret_code_t err_code;

    if(*data < 0)
    {
        err_code = NRF_ERROR_INVALID_LENGTH;
        APP_ERROR_CHECK(err_code);
    }
}